<template>
	<!-- 隐私政策 -->
	<wd-popup v-model="open" custom-style="height:800rpx;width:80%;"  :z-index="21000" custom-class="uni-border-radius-lg">
		<view class="uni-text-bold uni-p-sm uni-text-center uni-w-full uni-text-lg">隐私政策</view>
	    <view class="uni-p-sm"> 
			<scroll-view scroll-y style="height: 600rpx;">
				<view style="color:#60646d;padding: 20rpx;">
					<view>欢迎使用爱豆甄选的产品!</view>
					<view>引言</view>
					<view>
						爱豆甄选(南昌爱豆网络科技有限公司,以下或称“我们”)非常注重保护所有服务用户(以下或称“您”)的个人
						信息及隐私。我们深知个人信息对您的重要性，将以高度勤勉，审慎义务对待这些信息，按照法律法规和业界
						成熟的标准，采取相应的安全措施来保护您的个人信息。
						<text class="uni-font-underline under-line-color">同时，我们承若，我们将按业界成熟的安全标准，采取
						相应的安全保护措施来保护您的个人信息，请在使用我们的产品(或服务)前，仔细阅读并了解《爱豆甄选用户隐私政策》
						的条款(尤其是加粗划线内容)，以保障您的权益。.
						</text>
						为了给您提供更准确，更优质的服务，我们会按照本《爱豆甄选用户隐私政策》(本“隐私政策”)的规定使用和披露您的个人信息
						。除本隐私政策另有规定外，在未征得您事先许可的情况下，我们不会将您的个人信息对外披露或向第三方提供。
						<br/>
						<text class="uni-font-underline under-line-color">
							本隐私政策适用于爱豆甄选网站
							https://api.idoutech.com,(以下称“爱豆甄选平台”)。随着爱豆甄选平台提供服务的范围扩大，本隐私政策的内容可由
							我们随时更新，但任何更新均会通过平台公告，短信，邮件等方式向您通知。除非法律另行要求，更新后的隐私政策一经通知，即有效
							代替原来的隐私政策。您继续使用爱豆甄选平台的，视为您同意并接受爱豆甄选平台更新后的本隐私政策。您如果拒绝同意变更后的本隐私政策
							，您应立即停止访问使用爱豆甄选平台。您继续使用爱豆甄选平台服务的，是为您同意并接受爱豆甄选平台更新的政策。如发生有关争议时，以
							爱豆甄选平台最新的相关协议和规则为准
						</text>
						本隐私政策涉及到的个人敏感信息我们将加粗，标红，并加下划线的方式提示您注意阅读。
						<text  class="uni-font-underline under-line-color">
							在您向爱豆甄选平台提供任何属于敏感的个人信息前，请您考虑清楚该等提供是否是恰当的，并且同意您的个人敏感信息可按本隐私政策所述的目的和
							方式进行处理。我们会得到您的同意后收集和使用您的个人敏感信息以实现与爱豆甄选业务相关功能，并允许您对这些个人敏感信息的收集与
							使用做出不同的选择，但是拒绝使用这些信息会影响您使用相关功能。
						</text>
						本隐私政策属于《爱豆甄选用户服务协议》不可分割的一部分。我们希望通过本隐私政策向您清晰地介绍在使用我们的产品/服务时，我们如何收集，处理您的个人信息，
						并提供访问，更正，删除，保护这些信息的方式。
						<text class="uni-font-underline under-line-color">
							如您对本隐私政策有任何疑问或您在使用我们提供的服务时，个人信息受到了侵扰，或不同意协议中的任何条款，您应立即停止访问和使用爱豆甄选平台。
							当您使用爱豆甄选平台提供的任一服务时，即意味着同意我们按照本隐私条款政策收集、使用、储存和分享您的相关信息，
						</text>
						<text>本隐私政策将帮您了解以下信息:</text>
						<view>一、我们如何收集和使用您的个人信息</view>
						<view>二、我们如何存储和保护您的个人信息</view>
						<view>三、我们如何转让、公开披露您的个人信息</view>
						<view>四、您如何管理您的个人信息</view>
						<view>五、我们如何处理未成年人的个人信息</view>
						<view>六、本隐私政策的更新和通知</view>
						<view>七、如何联系我们</view>
						<view class="uni-text-bold  uni-text-lg uni-font-color-black">一、我们如何收集和使用您的个人信息</view>
						<view>1.登录注册</view>
						<view>1.1您注册并登录爱豆甄选平台账号时，需要按照我们的指引完成一系列注册程序，在此过程中，您需要向我们提供一下信息：<text class="under-line-color uni-font-underline">手机号码</text>
						(用于注册、登录以及接受验证码)。您只有提供真是准确的上述信息，才能成功注册爱豆甄选平台账号并使用爱豆甄选平台服务。
						如果您选择不提供上述为实现爱豆甄选服务的必备信息，或将导致我们无法为您提供爱豆甄选服务。
						</view>
						<view>
							1.2我们的产品支持您使用<text  class="uni-font-underline under-line-color">第三方平台的账号(微信账号)</text>
							进行注册、登录，如您使用第三方平台的账号注册、登录的，我们将根据您的授权获取该您注册并登录爱豆甄选平台账号时，需要按照我们的指引完成一系列注册程序，在此过程中，您需要向我们提供以下
							信息：<text class="uni-font-underline under-line-color">第三方账号下的相关信息，包括：微信昵称和头像。</text>我们承诺，收集上述信息是用于为您提供账号注册及登录服务以及保障您的账号安全，防范安全风险
							。您注册并登录爱豆甄选平台账号时，需要按照我们的指引完成一系列注册程序，在此过程中，您需要向我们提供以下信息：如您拒绝授权此类信息，则您无法使用第三方平台的账号登录我们平台，但不影响
							我们提供的其他产品和服务的正常使用，您仍可通过手机号码注册、登录爱豆甄选平台。
						</view>
						<view>
							1.3手机号码和验证码匹配结果属于您的个人信息，我们将根据中国法律下的认定规则以对该等信息采取相应的保护措施。我们收集该类信息是基于法律法规的相关要求，
							<text  class="uni-font-underline under-line-color">如您拒绝提供可能导致您无法注册账号并使用爱豆甄选服务的部分功能，请您谨慎考虑后再选择是否提供</text>
						</view>
						<view>
							我们在使用上述关键词信息会对相关信息进行脱敏处理，通常无法单独识别您的个人身份。如果您的搜索关键词信息与您的其他信息有联结并可识别您的个人身份时，我们会将您的搜索关键词信息作为您的个人信息，
							与您的搜索历史记录一同按照本隐私政策的规定对其进行处理与保护。如您拒绝提供本款下的信息。仅会使您无法使用该功能，但并不影响您正常使用爱豆甄选服务功能。
						</view>
						<view>
							2.推送功能
						</view>
						<view>
							您在使用我们的服务时，我们可能使用您的手机号码信息，向您发送短信、新闻或其他通知。如您拒绝提供本款下的信息，仅会使您无法收到我们发出的推送信息，但并不影响您正常使用爱豆甄选服务的其他功能。
						</view>
						<view class="uni-text-bold">
							征得授权同意(包括共享、转让、公开披露个人信息时事先征得授权同意的情形)的例外：
						</view>
						<view>
							根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下收集、使用一些必要的个人信息：
						</view>
						<view>
							1.与国家安全、国防安全直接相关的；
						</view>
						<view>
							2.与公共安全、公共卫生、重大公共利益直接相关的；
						</view>
						<view>
							3.与犯罪侦察、起诉、审判和判决执行等直接相关的；
						</view>
						<view>
							4.出于维护您的其他个人的生命、财产等重大合法权益但有很难得到本人同意的；
						</view>
						<view>
							5.所收集的个人信息是您自行向社会公众公开的；
						</view>
						<view>
							6.从合法公开披露的信息中收集到您的个人信息，如从合法的新闻报道、政府信息公开等渠道；
						</view>
						<view>
							7.根据您的要求签订和履行合同所必须的；
						</view>
						<view>
							8.法律法规规定的其他情形；
						</view>
						<view class="uni-text-bold uni-text-lg uni-font-color-black">
							二、我们如何保存和保护您的个人信息
						</view>
						<view>
							1.个人信息的保存
						</view>
						<view>
							1.1保存期限：除非根据法律法规或双方约定，我们仅会在实现目的所必需的时间内留存您的相关个人信息。在您注销账号时，我们将根据法律法规删除您的个人信息。对于超出期限的个人信息，
							我们会立即删除或做匿名化处理；若根据适用法律需要保护您的个人信息的，我们将不再为任何其他目的使用您的信息。
						</view>
						<view class="uni-text-bold">
							但在下列情况下，我们可能需根据法律法规要求，更改个人信息的存储时间：
							<view>
								(1)为遵守或我们有理由确信需要遵守适用的法律法规等相关规定；
							</view>
							<view>
								(2)为遵守法院判决、裁定或其他法律程序的规定；
							</view>
							<view>
								(3)为遵守相关政府机关或法定授权组织的要求；
							</view>
							<view>
								(4)为执行相关服务协议或本政策、维护社会公共利益，为保护客户、我们或我们的关联公司、其他用户或雇员的人身财产安全或其他合法权益所合理必须的用途。
							</view>
						</view>
						<view>
							2 个人信息的保护
						</view>
						<view>
							为保障您的信息安全，我们努力采取各种合理的物理，电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄露、损毁或者丢失，包括但不限于SSL加密传输，信息加密存储、数据中心的访问控制
							。我们对可能接触到您的信息的员工才采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。
						</view>
						<view class="uni-text-bold uni-text-lg uni-font-color-black">
							三、我们如何共享、转让、公开披露您的个人信息
						</view>
						<view>
							我们不会将您的个人信息向如何公司、组织和个人(我们的员工除外)披露和/转让，但以下情况除外：
						</view>
						<view>
							1.共享
						</view>
						<view>
							为了实现爱豆甄选的功能，我们可能会接入第三方服务商提供的SDK或其他类似的应用程序(如以嵌入代码、插件等形式)。
						</view>
						<view>
							2.公开披露
						</view>
						<view>
							我们仅会在以下情况下，且依照准前提下，才可能公开披露您的个人信息：
						</view>
						<view>
							2.1在您明确同意的披露方式下披露您指定的个人信息；
						</view>
						<view>
							2.2根据法律的相关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
						</view>
						<view>
							2.3如您出现违反中国有关法律、法规或相关规则的情况，需要向第三方披露。
						</view>
						<view class="uni-text-bold uni-text-lg uni-font-color-black">
							四、您如何管理您的个人信息
						</view>
						<view>
							1.您有权通过本隐私政策第五条联系我们、要求访问、更正、删除您的个人信息，法律法规的例外情况除外。您也可以通过以下方式管理您的个人信息：
						</view>
						<view>
							1.1账户信息：您可以访问、更正您账户中的个人信息(包括但不限于密码、绑定账号)；
						</view>
						<view>
							2.改变授权，您可以通过系统中取消授权功能来改变授权。请您理解，当您执行上述操作后，我们可能无法继续为您提供授权对应的服务。
						</view>
						<view>
							3.注销账户：您有权注销您的爱豆甄选账户，您可以访问爱豆甄选网站上的"联系客服"页面继续注销。
						</view>
						<view>
							为保障安全，您可能需要提供书面请求以实现您的管理权力，或在行使管理权力前以其他方式证明您的身份。我们肯会先要求您验证自己的身份，如何再处理您的请求。
						</view>
						<view class="uni-text-bold uni-text-lg uni-font-color-black">
							五、我们如何处理未成年人的个人信息
						</view>
						<view class="uni-font-underline under-line-color">
							1.爱豆甄选服务主要面向成年人(原则上18周岁以上为成年人，16周岁以上且以自己的劳动收入为主要生活来源的我们亦视为成年人)。若您是未成年人，我们不建议您使用爱豆甄选平台。如
							确需使用的，在使用我们的产品和/或服务前，您应在监护人的陪同下阅读本隐私政策，并应确保已征得您的监护人同意后使用我们的服务并向我们提供您的信息。我们会根据国家相关法律法规的规定
							着重保护未成年人的个人信息。
						</view>
						<view>
							2.如您的监护人不同意您按照本隐私政策使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，如我们证实存在上述情况的，我们也有权立即终止向您提供服务。
						</view>
						<view>
							3.对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许，父母或监护人明确同意或者保护未成年人所需要的情况下使用或公开披露信息。
						</view>
						<view class="uni-font-underline under-line-color">
							4.若您是未成年人的监护人，当您对您所监护的未成年人使用我们的服务或其向我们提供的用户信息有任何疑问时，请您及时与我们联系。我们将根据国家相关法律法规及本隐私政策的规定保护未成年人用户信息的保密性及安全性
							如何我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。
						</view>
						<view class="uni-text-bold uni-text-lg uni-font-color-black">
							六、本隐私政策的更新和通知
						</view>
						<view class="uni-font-underline under-line-color"> 
							我们的隐私政策可能变更。未经您明确同意，我们不会削减您按照本隐私政策所应当享有的权力。我们会在爱豆甄选平台上发布及更新通知并在本页面上发布更新后的隐私政策。
						</view>
						<view>
							对于重大变更、我们还会提供更为显著的通知(包括对于某些服务，我们会通过弹窗提示，首页展示等说明隐私政策的具体变更内容)。本隐私政策所指的重大变更包括但不限于：
						</view>
						<view>
							1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等：
						</view>
						<view>
							2.我们在所有权结构、组织架构等方面发生重大变化。如业务调整等引起所有者变更等’
						</view>
						<view>
							3.您参与个人信息处理方面的权力及其行使方式发生重大变化
						</view>
						<view>
							4.个人信息共享、或公开披露的主要对象发生变化
						</view>
						<view>
							5.我们负责处理个人信息安全的责任部门，联络方式及投诉渠道发生变化时；
						</view>
						<view>
							6.个人信息安全影响评估报告表明存在高风险时。
						</view>
						<view class="uni-text-bold uni-text-lg uni-font-color-black">
							七、如何联系我们
						</view>
						<view>
							如果您对我们的隐私政策及对您个人信息的处理有如何的疑问、意见、建议或投诉，或者希望行使您的权力，可以通过以下方式联系我们：
						</view>
						<view>
							1.您可以通过爱豆甄选网站上显示的联系方式联系我们；
						</view>
						<view>
							我们将在十五个工作日内向您回复。
						</view>
					</view>
				</view>
			</scroll-view>
		</view>
		<view class="uni-flex uni-justify-center uni-mt-lg">
			<wd-button @click="open = false">确定</wd-button>
		</view>
	</wd-popup>
</template>

<script setup>
	import { defineModel } from 'vue';
	const open = defineModel('open',{
		type:Boolean,
		default:false
	})
</script>

<style lang="scss">
	.under-line-color{
		color: #2a2a2c;
	}
</style>